train: /Users/kalk/dev/yolov5/dev_2022/train.txt
val: /Users/kalk/dev/yolov5/dec_2022/val.txt
test: /Users/kalk/dev/yolov5/dec_2022/test.txt


#nc: 22
#nc: 26
nc: 18

# Subclasses and conditions:
nc_manhole: 5
nc_drain: 5
nc_signs: 5
nc_roadedge: 5
nc_crack: 3
nc_croc: 3


# Used by YOLOv5
names: &classes
    - A20 # plate
    - D40 # hole
    - D50 # crack [INACTIVE]
#   - P10 # crosswalk
    - A10 # face
    - P20 # lane marking
    - D20 # crocodile crack
    - D10 # crack
#   - D41 # pothole
#   - D60 # curb damage
    - R30 # crack seal
    - S10 # permanent sign
    - D30 # raveling
    - R10 # area patch
    - M10 # manhole
    - M20 # drain
#   - F10 # skid mark
#   - M30 # hydrant
#   - D70 # sidewalk tile crack
#   - D80 # vegetation from below
#   - M40 # scaffolding
#   - M50 # container
#   - F20 # wooden stick
    - S20 # temporary sign
    - R20 # spot patch
    - S30 # sign back
    - S40 # bollard
#   - D51 # rutting
    - D81 # edge deterioration

# Used by Pluto-Data
pluto_classes_used: *classes

pluto_only_classes_used: true

pluto_random_state: 10

# Add an extra output layer for subclasses
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
   [[17, 20, 23], 1, Detect, [nc_manhole]],
   [[17, 20, 23], 1, Detect, [nc_drain]],
   [[17, 20, 23], 1, Detect, [nc_sign]],
   [[17, 20, 23], 1, Detect, [nc_edgepole]],
   [[17, 20, 23], 1, Detect, [nc_crack]],
   [[17, 20, 23], 1, Detect, [nc_croc]],
  ]
